Revit 2027 API
HostObjectUtils.GetBottomFaces Method
 Returns the bottom faces for this host object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<Reference> GetBottomFaces(
	HostObject hostObject
)
Public Shared Function GetBottomFaces (
	hostObject As HostObject
) As IList(Of Reference)
public:
static IList<Reference^>^ GetBottomFaces(
	HostObject^ hostObject
)
static member GetBottomFaces :
        hostObject : HostObject -> IList<Reference>
Parameters
hostObject HostObject
 The host object.
Return Value
IList<Reference>
 An array of references to the faces which are at the bottom of this element.
Exceptions
Exception | Condition
ArgumentException |  This host object does not support access to top or bottom faces.
ArgumentNullException |  A non-optional argument was null
Remarks
 This utility supports host objects whose bottom faces represent one of the boundaries of CompoundStructure (such as roofs, floors or ceilings).
See Also
Reference
HostObjectUtils Class
Autodesk.Revit.DB Namespace